In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')

In [5]:
df['new_col']='krishna caitnya mahaprabhu'

In [6]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new_col
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,krishna caitnya mahaprabhu
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,krishna caitnya mahaprabhu
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,krishna caitnya mahaprabhu
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,krishna caitnya mahaprabhu
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,krishna caitnya mahaprabhu
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,krishna caitnya mahaprabhu
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,krishna caitnya mahaprabhu
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,krishna caitnya mahaprabhu
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,krishna caitnya mahaprabhu
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,krishna caitnya mahaprabhu

In [9]:
d={'name':'krsna' , 'abode':'golok' , 'mail': "krsnacaitnya@gmail.com"}

In [10]:
pd.DataFrame(d,index=['name', 'abode', 'mail'])

        name  abode                    mail
name   krsna  golok  krsnacaitnya@gmail.com
abode  krsna  golok  krsnacaitnya@gmail.com
mail   krsna  golok  krsnacaitnya@gmail.com

In [12]:
import numpy as np

In [14]:
np.array([1,323,54,65,6])

array([  1, 323,  54,  65,   6])

In [15]:
pd.Series(np.array([1,323,54,65,6]))

0      1
1    323
2     54
3     65
4      6
dtype: int32

In [17]:
ser=pd.Series(np.array([1,323,54,65,6]), index=['krsna', 'radha', 'caitnya', 'govind','mukund'])

In [18]:
ser

krsna        1
radha      323
caitnya     54
govind      65
mukund       6
dtype: int32

In [19]:
ser['radha']

323

In [20]:
ser.loc['radha']

323

In [ ]:
# now lets say we have another series

In [23]:
ser1=pd.Series(np.array([1,323,54,65,6]), index=[3,45,45,645,67])

In [32]:
ser1

3        1
45     323
45      54
645     65
67       6
dtype: int32

In [38]:
ser1.iloc[67]

IndexError: single positional indexer is out-of-bounds

In [39]:
ser1.loc[45]

45    323
45     54
dtype: int32